Tekla.Structures.Drawing.ReinforcementBase.StraightEndSymbolTypes
The available straight end symbol types.
See Tekla Structures help, "Reinforcement appearance", for more information.

Tekla.Structures.Drawing.ReinforcementBase.StraightEndSymbolTypes.NoSymbol
No straight end symbol.

Tekla.Structures.Drawing.ReinforcementBase.StraightEndSymbolTypes.HooksOnInnerSide
Draws half hooks on the reinforcement's inner side.

Tekla.Structures.Drawing.ReinforcementBase.StraightEndSymbolTypes.HooksOnOuterSide
Draws half hooks on the reinforcement's outer side.

Tekla.Structures.Drawing.ReinforcementBase.StraightEndSymbolTypes.HookOnReinforcementStartOuterSide
Draws a half hook on the reinforcement's outer side in the reinforcement's start point,
and another half hook on the inner side in the end point.

Tekla.Structures.Drawing.ReinforcementBase.StraightEndSymbolTypes.HookOnReinforcementStartInnerSide
Draws a half hook on the reinforcement's inner side in the reinforcement's start point,
and another half hook on the outer side in the end point.

Tekla.Structures.Drawing.ReinforcementBase.StraightEndSymbolTypes.FullHooks
Draws full hooks in the reinforcement's end points.